gastonfeng/bootloader_stm32/mFirmata.cpp
            // port2 = *(uint16_t *) argv;
            //            kSerial::get_serial(port2)->set_low();
            break;
#endif
#if defined(RTE_APP) || defined(PLC)
        case FM_GET_TASK_NRS:
            fm->sendSysex(FirmataStream, FM_GET_TASK_NRS, 1, &(plc_var.info.plc_task_cnt));
            break;
        case FM_GET_TASK_NAME:
            if (tasks[argv[0]]) {
                fm->sendSysex(FirmataStream, FM_GET_TASK_NAME, (byte) strlen(tasks[argv[0]]->name),
                              (byte *) tasks[argv[0]]->name);
            }
            break;
        case FM_GET_TASK_DETAIL:
            if (tasks[argv[0]]) {
                fm->sendSysex(FirmataStream, FM_GET_TASK_DETAIL, 24, tasks[argv[0]]->mata());
            }
            break;
        case FM_GET_PLC_STATE:
            fm->sendSysex(FirmataStream, FM_GET_PLC_STATE, 1, (byte *) (&plc_var.info.plc_state));
            break;
        case FM_GET_PLC_INFO:
            if (plc_var.info.plc_curr_app) {
                info.build = plc_var.info.plc_curr_app->buildnumber;
                strcpy(info.name, plc_var.info.plc_curr_app->app_name);
                fm->sendSysex(FirmataStream, FM_GET_PLC_INFO, sizeof(info), (byte *) &info);
            } else
                fm->sendSysex(FirmataStream, FM_GET_PLC_INFO, 0, (byte *) &info);
            break;
        case CB_GET_LOG_NUMBER:
            fm->sendSysex(FirmataStream, CB_GET_LOG_NUMBER, 5, (byte *) (&plc_var.info.plc_state));
            break;
        case CB_GET_LOG:
            fm->write(FirmataStream, START_SYSEX);
            fm->write(FirmataStream, CB_GET_LOG);
            fm->write(FirmataStream, 0);
            fm->write(FirmataStream, END_SYSEX);
            fm->flush(FirmataStream);
            break;
#ifdef USE_BOOTLOADER
            case CB_GET_BOOT_VERSION:
#ifdef BOOTINFO
                boot_t *b;
                b = (boot_t *)BOOTINFO; // platformio.ini中定义
                if (b)
                    fm->sendSysex(FirmataStream, CB_GET_BOOT_VERSION, sizeof(boot_t), (byte *)b);
                else
#endif
                {
                    fm->write(FirmataStream, START_SYSEX);
                    fm->write(FirmataStream, CB_GET_BOOT_VERSION);
                    fm->write(FirmataStream, 0);
                    fm->write(FirmataStream, END_SYSEX);
                    fm->flush(FirmataStream);
                }
                break;
            case FM_FLASH_BOOT:
                len = board.updateBootbin();
                fm->sendSysex(FirmataStream, FM_FLASH_BOOT, len, (byte *)&len);
                break;
#endif
#endif
#ifdef USE_KVDB
        case FM_LIST_KEY:
            kvdb.list(fm, FirmataStream);
            break;
        case CB_READ_KEY:
            size_t vlen;
            buffer = kvdb.get((const char *) argv);
            vlen = strlen(buffer);
            if (buffer && (vlen > 0))
                fm->sendSysex(FirmataStream, CB_READ_KEY, (byte) vlen, (byte *) buffer);
            else
                fm->sendSysex(FirmataStream, CB_READ_KEY, 0, (byte *) buffer);
            break;
        case FM_READ_KEY_BYTES:
            data = (u8 *) malloc(256);
            len = kvdb.get((const char *) argv, (char *) data + 4, 256, (u32 *) data);
            fm->sendSysex(FirmataStream, FM_READ_KEY_BYTES, len + 4, (byte *) data);
            free(data);
            break;
        case CB_WRITE_KEY:
            size_t key_len;
            key_len = strlen((const char *) argv);
            int rw;
            rw = kvdb.set((const char *) argv, (const char *) argv + key_len + 1, (int) (argc - key_len - 2));
            fm->sendSysex(FirmataStream, CB_WRITE_KEY, 4, (byte *) &rw);
            break;
        case FM_WRITE_KEY_BYTES:
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            key_len = strlen((const char *) decodeBuf);
            uint32_t type;
            type = *(uint32_t *) (decodeBuf + key_len + 1);
            len = kvdb.set((const char *) decodeBuf, (const char *) (decodeBuf + key_len + 1 + 4),
                           (int) (decodedLen - key_len - 1 - 4), type);
            fm->sendSysex(FirmataStream, FM_WRITE_KEY_BYTES, 4, (byte *) &len);
            break;
        case CB_RM_KEY:
            kvdb.remove((const char *) argv);
            fm->sendSysex(FirmataStream, CB_RM_KEY, 0, argv);
            break;
        case CB_SET_TSL_RANGE:
            tsl_query q;
            q.count = -1;
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            key_len = strlen((const char *) decodeBuf);
            if (decodedLen == key_len + 13) {
                start = *(u32 *) &decodeBuf[key_len + 1];
                end = *(u32 *) &decodeBuf[key_len + 1 + 4];
                state = (int) *(u32 *) &decodeBuf[key_len + 1 + 8];
                tsdb.query((const char *) decodeBuf, start, end, (fdb_tsl_status) (state), &q);
            }
            fm->sendSysex(FirmataStream, CB_SET_TSL_RANGE, sizeof(tsl_query), (byte *) &q);
            break;
        case CB_SET_TSL_STATUS:
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            key_len = strlen((const char *) decodeBuf);
            len = -1;
            if (decodedLen == key_len + 13) {
                start = *(u32 *) &decodeBuf[key_len + 1];
                end = *(u32 *) &decodeBuf[key_len + 1 + 4];
                state = (int) *(u32 *) &decodeBuf[key_len + 1 + 8];
                len = tsdb.set_status((const char *) decodeBuf, start, end, (fdb_tsl_status) (state));
            }
            fm->sendSysex(FirmataStream, CB_SET_TSL_STATUS, 4, (byte *) &len);
            break;
        case CB_GET_TSL:
            char *tbuf;
            int tlen;
            tbuf = (char *) malloc(256);
            memset(tbuf, 0, 256);
            tlen = tsdb.query_read((const char *) argv, (u32 *) &tbuf[0], (fdb_time_t *) &tbuf[4],
                                   (int *) (tbuf + 8),
                                   tbuf + 12, 256 - 12);
            if (tlen < 0)
                tlen = 0;
            else {
                *(u32 *) &tbuf[tlen] = GenerateCRC32Sum((const u8 *) tbuf, tlen, 0);
                tlen += 4;
            }
            fm->sendSysex(FirmataStream, CB_GET_TSL, (byte) tlen, (byte *) tbuf);
            free(tbuf);
            break;
        case CB_TSL_CLEAR:
            key_len = strlen((const char *) argv);
            // index = *(int *) &argv[key_len + 1];

            fm->sendSysex(FirmataStream, CB_TSL_CLEAR, (byte) sizeof(state), (byte *) &state);
            state = TSL::clear((const char *) (argv));
            break;
#endif
#ifdef USE_SOEM
            case FM_SOEM_SCAN:
                soem_scan(fm, FirmataStream);
                break;
#endif
#if defined(RTE_APP) || defined(PLC)
        case CB_SET_PLC_FILE:
            app.setPLCDLL((char *) argv);
            fm->write(FirmataStream, START_SYSEX);
            fm->write(FirmataStream, CB_SET_PLC_FILE);
            fm->write(FirmataStream, 0);
            fm->write(FirmataStream, END_SYSEX);
            fm->flush(FirmataStream);
            break;
        case CB_CPU_USAGE:
            fm->sendSysex(FirmataStream, CB_CPU_USAGE, 1, (byte *) &plc_var.info.cpu_usage);
            break;
#endif
#ifdef USE_WIFI
            case CB_WIFI_LIST:
                fm->sendSysex(FirmataStream, CB_WIFI_LIST, plc_var.info.wifi_size, (byte *)&plc_var.info.wifi_list);
                break;
            case CB_WIFI_SET_PASS:
                int plen;
                plen = strlen((const char *)argv);
                kvdb.set("wifi_pass", (const char *)argv, plen);
                wifi_reload();
                fm->sendSysex(FirmataStream, CB_WIFI_SET_PASS, 0, argv);
                break;
#endif
#if defined(RTE_APP) || defined(PLC)
#ifndef PLC
        case FM_PUT_DATA_BLOCK:
            u32 crc, crc_r;
            byte *buffer_data;
            if (argc < 12)
                break;
            buffer_data = (byte *) malloc(argc);

            len_data = decodeByteStream(argc, argv, buffer_data);
            crc = GenerateCRC32Sum((const u8 *) buffer_data, len_data - 4, 0);
            crc_r = *(u32 *) (&buffer_data[len_data - 4]);
            if (crc_r != crc) {
                state = CRC_ERROR;
                logger.error("crc error block %d 0x%x 0x%x argc=%d len=%d", *(int *) &buffer_data[0], crc, crc_r, argc,
                             len_data);
            } else {
                rte.set_state(PLC_STATUS::APP_FLASH_BEGIN);
                int block = *(int *) &buffer_data[0];
                if (block == 0) {
                    // if (ifirmata.dev) {
                    //     state = DEV_IS_OPEN;
                    // } else
                    {
                        u32 object = *(u32 *) &buffer_data[4];

                        ifirmata.dev = mem_block::mems[object];
                        if (!ifirmata.dev) {
                            state = NO_DEVICE;
                        } else {
                            state = ifirmata.dev->begin(&buffer_data[8], len_data - 8);
                            if (state > 0 && state > ifirmata.parser.dataBufferSize * 7 / 8 - 4) {
                                state = (int) (ifirmata.parser.dataBufferSize * 7 / 8 - 4);
                            }
                            logger.info("recv %s ,size= %d", &buffer_data[12], *(u32 *) &buffer_data[8]);
                        }
                    }
                } else if (block == -1) {
                    if (ifirmata.dev) {
                        if (ifirmata.dev->Shutdown() < 0) {
                            state = DEVICE_SHUTDOWN_ERR;
                        } else {
                            state = 1;
                            rte.set_state(PLC_STATUS::APP_FLASH_END);
                            logger.info("recv end.");
                            ifirmata.dev = nullptr;
                        }
                    }
                } else {
                    if (ifirmata.dev) {
                        if (ifirmata.dev->Write(&buffer_data[4], len_data - 8) < 0) {
                            state = DEVICE_WRITE_ERR;
                        } else {
                            state = block;
                        }
                        logger.info("recv %d ,size= %d", block, len_data - 8);
                    }
                }
            }
            fm->sendSysex(FirmataStream, FM_PUT_DATA_BLOCK, 4, (byte *) &state);
            free(buffer_data);
            break;
#endif
        case FM_GET_LOC_SIZE:
            if (plc_var.info.plc_curr_app) {
                fm->sendSysex(FirmataStream, FM_GET_LOC_SIZE, 2, (byte *) &plc_var.info.plc_curr_app->l_sz);
            } else {
                fm->sendSysex(FirmataStream, FM_GET_LOC_SIZE, 0, (byte *) &plc_var.info.plc_curr_app->l_sz);
            }
            break;
        case FM_GET_LOC:
            u32 l_index;
            if (argc == 5) {
                decodeByteStream(argc, argv, (byte *) &l_index);
                if (plc_var.info.plc_curr_app && l_index < plc_var.info.plc_curr_app->l_sz) {
                    plc_loc_tbl_t loc = plc_var.info.plc_curr_app->l_tab[l_index];
                    len = (int) sizeof(plc_loc_dsc_t) + loc->a_size + loc->v_size;
                    buffer = (char *) malloc(len);
                    buffer[0] = loc->v_type;
                    buffer[1] = loc->v_size;
                    *(u16 *) &buffer[2] = loc->proto;
                    *(u16 *) &buffer[4] = loc->a_size;
                    memcpy(&buffer[6], loc->a_data, loc->a_size);
                    memcpy(&buffer[6 + loc->a_size], loc->v_buf, loc->v_size);
                    fm->sendSysex(FirmataStream, FM_GET_LOC, len, (byte *) buffer);
                    free(buffer);
                    break;
                }
            }
            fm->sendSysex(FirmataStream, FM_GET_LOC, 0, (byte *) &plc_var.info.plc_curr_app->l_sz);
            break;
        case FM_SET_LOC:
            if (argc == 5) {
                decodeByteStream(argc, argv, (byte *) &l_index);
                if (plc_var.info.plc_curr_app && l_index < plc_var.info.plc_curr_app->l_sz) {
                    fm->sendSysex(FirmataStream, FM_SET_LOC, sizeof(plc_loc_tbl_t),
                                  (byte *) &plc_var.info.plc_curr_app->l_tab[l_index]);
                    break;
                }
            }
            fm->sendSysex(FirmataStream, FM_SET_LOC, 0, (byte *) &plc_var.info.plc_curr_app->l_sz);
            break;
#endif
#ifdef ONLINE_DEBUG
            case FM_GET_DBG_SIZE:
                if (plc_var.info.plc_curr_app)
                {
                    fm->sendSysex(FirmataStream, FM_GET_DBG_SIZE, 4,
                                  (byte *)&plc_var.info.plc_curr_app->data->size_dbgvardsc);
                }
                else
                {
                    fm->sendSysex(FirmataStream, FM_GET_DBG_SIZE, 0, nullptr);
                }
                break;
            case FM_GET_DBG:
                len = 0;
                if (argc == 5)
                {
                    decodeByteStream(argc, argv, (byte *)&l_index);
                    if (plc_var.info.plc_curr_app && l_index < plc_var.info.plc_curr_app->data->size_dbgvardsc)
                    {
                        len = (int)fill_dbg((int)l_index, decodeBuf);
                    }
                }
                fm->sendSysex(FirmataStream, FM_GET_DBG, len, decodeBuf);
                break;
            case FM_SET_DBG:
                len = 0;
                if (argc > 5)
                {
                    decodedLen = decodeByteStream(argc, argv, (byte *)&decodeBuf);
                    l_index = *(u32 *)decodeBuf;
                    if (plc_var.info.plc_curr_app && l_index < plc_var.info.plc_curr_app->data->size_dbgvardsc)
                    {
                        set_dbg(l_index, &decodeBuf[4], decodedLen - 4);
                        len = (int)fill_dbg((int)l_index, decodeBuf);
                    }
                }
                fm->sendSysex(FirmataStream, FM_GET_DBG, len, decodeBuf);
                break;
#endif
#if defined(RTE_APP) || defined(PLC)
        case FM_LOG_SET_LEVEL:
            plc_var.config.log_level = argv[0];
            fm->sendSysex(FirmataStream, FM_LOG_SET_LEVEL, 1, &plc_var.config.log_level);
            break;
#endif
#ifdef ARDUINO_ARCH_STM32
        case FM_GET_CPU_SN:
            u32 sn[3];
            sn[0] = HAL_GetUIDw0();
            sn[1] = HAL_GetUIDw1();
            sn[2] = HAL_GetUIDw2();
            fm->sendSysex(FirmataStream, FM_GET_CPU_SN, 12, (byte *) sn);
            break;
#endif
#if defined(RTE_APP) || defined(PLC)
        case FM_READ_MEM:
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            indexv = 0;
            len = 0;
            if (decodedLen == 6) {
                indexv = *(u32 *) decodeBuf;
                len = *(u16 *) &decodeBuf[4];
            }
            fm->sendSysex(FirmataStream, FM_READ_MEM, len, (byte *) indexv);
            break;
        case FM_WRITE_MEM:
            if (argc > 6) {
                buffer = (char *) malloc(argc);
                decodedLen = decodeByteStream(argc, argv, (byte *) buffer);
                indexv = *(u32 *) buffer;
                len = *(u16 *) &buffer[4];
                for (int i = 0; i < len; i++) {
                    *((uint8_t *) indexv + i) = buffer[6 + i];
                }
                fm->sendSysex(FirmataStream, FM_WRITE_MEM, len, (byte *) indexv);
                free(buffer);
            }
            break;
        case FM_READ_VALUE:
            u8 region;
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            indexv = 0;
            len = 0;
            if (decodedLen == 7 && decodeBuf[0] < 8) {
                region = decodeBuf[0];
                indexv = *(u32 *) &decodeBuf[1];
                len = *(u16 *) &decodeBuf[5];
                decodeBuf[0] = region;
                *(u32 *) &decodeBuf[1] = indexv;

                switch (region) {
                    case 0: // byte from 0
                        fm->sendSysex(FirmataStream, FM_READ_VALUE_REP, len, ((byte *) &plc_var) + indexv);
                        break;
                    case 1: // digitalValue
                        fm->sendSysex(FirmataStream, FM_READ_VALUE_REP, len, ((byte *) &plc_var) + indexv);
                        break;
                    case 2: // analogValue
                        if (len > (sizeof(decodeBuf) / 2 + 5)) {
                            len = sizeof(decodeBuf) / 2 - 3;
                        }
                        for (int i = 0; i < len; i++) {
                            const char *p;
                            p = (const char *) &plc_var.analogValue;
                            memcpy(&decodeBuf[5 + i * 4], &p[(indexv + i) * 2], 2);
                        }
                        fm->sendSysex(FirmataStream, FM_READ_VALUE_REP, len * 2 + 5, (byte *) decodeBuf);
                        break;
                    case 3: // analogValue32
                        if (len > (sizeof(decodeBuf) / 4 + 4)) {
                            len = sizeof(decodeBuf) / 4 - 1;
                        }
                        for (int i = 0; i < len; i++) {
                            const char *p;
                            p = (const char *) &plc_var.analogValue32;
                            memcpy(&decodeBuf[5 + i * 4], &p[(indexv + i) * 4], 4);
                        }
                        fm->sendSysex(FirmataStream, FM_READ_VALUE_REP, len * 4 + 5, ((byte *) decodeBuf));
                        break;
                    case 4: // holdValue
                        fm->sendSysex(FirmataStream, FM_READ_VALUE_REP, len, ((byte *) &plc_var) + indexv);
                        break;
                    case 5:
                        fm->sendSysex(FirmataStream, FM_READ_VALUE_REP, len, ((byte *) &plc_var) + indexv);
                        break;
                    case 6:
                        fm->sendSysex(FirmataStream, FM_READ_VALUE_REP, len, ((byte *) &plc_var) + indexv);
                        break;
                    case 7:
                        fm->sendSysex(FirmataStream, FM_READ_VALUE_REP, len, ((byte *) &plc_var) + indexv);
                        break;
                }
            } else
                fm->sendSysex(FirmataStream, FM_READ_VALUE_REP, len, ((byte *) &plc_var) + indexv);
            break;
        case FM_WRITE_VALUE:
            if (argc > 6) {
                buffer = (char *) malloc(argc);
                decodedLen = decodeByteStream(argc, argv, (byte *) buffer);
                indexv = *(u32 *) buffer;
                len = *(u16 *) &buffer[4];
                if (len < (argc - 6)) {
                    for (int i = 0; i < len; i++) {
                        *(((uint8_t *) &plc_var) + indexv + i) = buffer[6 + i];
                    }
                }
                fm->sendSysex(FirmataStream, FM_WRITE_VALUE_REP, len, (byte *) ((uint8_t *) &plc_var) + indexv);
                free(buffer);
            }
            break;
        case FM_READ_BIT:
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            indexv = 0;
            len = 0;
            if (decodedLen == 6) {
                indexv = *(u32 *) decodeBuf;
                len = *(u16 *) &decodeBuf[4];
            }
            if (len > 0) {
                buffer = (char *) malloc(len / 8 + 6);
                *(u32 *) buffer = indexv;
                buffer[4] = len;
                for (int i = 0; i < len; i++) {
                    u8 b = plcVar.digitalValue(indexv + i);
                    buffer[i / 8 + 5] |= b << (i % 8);
                }
                fm->sendSysex(FirmataStream, FM_READ_BIT_REP, len / 8 + 6, (byte *) buffer);
                free(buffer);
            }
            break;
        case FM_WRITE_BIT:
            if (argc > 6) {
                buffer = (char *) malloc(argc);
                decodedLen = decodeByteStream(argc, argv, (byte *) buffer);
                indexv = *(u32 *) buffer;
                len = *(u16 *) &buffer[4];
                if (len < (argc - 6)) {
                    for (int i = 0; i < len; i++) {
                        *(((uint8_t *) &plc_var) + indexv + i) = buffer[6 + i];
                    }
                }
                fm->sendSysex(FirmataStream, FM_WRITE_VALUE_REP, len, (byte *) ((uint8_t *) &plc_var) + indexv);
                free(buffer);
            }
            break;
#endif
        case FM_READ_VALUE_REP:
            if (argc > 0) {
                decodedLen = decodeByteStream(argc, argv, decodeBuf);
                memcpy(mfm->valueBuf, decodeBuf, decodedLen);
                mfm->valueLen = decodedLen;
            }
            break;
        case FM_WRITE_VALUE_REP:
            if (argc > 0 && argc < 8) {
                decodedLen = decodeByteStream(argc, argv, decodeBuf);
            }
            break;
        case FM_READ_BIT_REP:
            if (argc > 0) {
                decodedLen = decodeByteStream(argc, argv, decodeBuf);
                memcpy(mfm->valueBuf, decodeBuf, decodedLen);
                mfm->valueLen = decodedLen;
            }
            break;
        case FM_WRITE_BIT_REP:
            if (argc > 0 && argc < 8) {
                decodedLen = decodeByteStream(argc, argv, decodeBuf);
            }
            break;
#if defined(RTE_APP) || defined(PLC)
        case FM_READ_LOC:
            if (argc < 5)
                break;
            decodedLen = decodeByteStream(argc, argv, (byte *) decodeBuf);
            if (decodedLen < 5)
                break;
            len = board.get_input(decodeBuf[0], decodeBuf[1], decodeBuf[2], decodeBuf[3], (char *) decodeBuf);
            fm->sendSysex(FirmataStream, FM_READ_LOC, len, (byte *) decodeBuf);
            break;
        case FM_WRITE_LOC:
            decodedLen = decodeByteStream(argc, argv, (byte *) decodeBuf);
            len = board.set_output(decodeBuf[0], decodeBuf[1], decodeBuf[2], decodeBuf[3], (char *) &decodeBuf[4],
                                   decodedLen - 4);
            fm->sendSysex(FirmataStream, FM_READ_LOC, len, (byte *) decodeBuf);
            break;
        case FM_GET_LOCATION:
            byte *buf_fgl;
            buf_fgl = (byte *) malloc(32);
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            len = 0;
            if (decodedLen >= 4) {
                len = board.get_input(decodeBuf[1], decodeBuf[2], decodeBuf[3], 0, (char *) buf_fgl);
            }
            fm->sendSysex(FirmataStream, FM_GET_LOCATION, len, (byte *) buf_fgl);
            free(buf_fgl);
            break;
        case FM_SET_LOCATION:
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            len = -1;
            if (decodedLen >= 6) {
                len = board.set_output(decodeBuf[1], decodeBuf[2], decodeBuf[3], 0, (char *) &decodeBuf[5],
                                       decodeBuf[4]);
            }
            fm->sendSysex(FirmataStream, FM_SET_LOCATION, 4, (byte *) &len);
            break;
#endif
        case CB_GOTO_IAP:
            fm->sendSysex(FirmataStream, CB_GOTO_IAP, 0, nullptr);
            boardBase::goto_iap();
        case CB_RESET:
            len = 0;
            fm->sendSysex(FirmataStream, CB_RESET, 4, (byte *) &len);
            RTE::reset();
            break;
        default:
            len = -1;
            fm->sendSysex(FirmataStream, command, 4, (byte *) &len);
            break;
    }
    mfm->set_flag(command);
}

void digitalWriteCallback(firmata::FirmataClass *fm, Stream *FirmataStream, byte port, int value) {
#if defined(RTE_APP) || defined(PLC)
    byte lastPin, pinValue, mask = 1, pinWriteMask = 0;

