gastonfeng/bootloader_stm32/mFirmata.cpp
    if (port < IO_XI_NRS + IO_YO_NRS) {
        // create a mask of the pins on this port that are writable.
        lastPin = port * 8 + 8;
        if (lastPin > IO_YO_NRS + IO_XI_NRS + IO_XA_NRS + IO_YA_NRS)
            lastPin = IO_YO_NRS + IO_XI_NRS + IO_XA_NRS + IO_YA_NRS;
#ifdef ARDUINO
        for (byte pin = port * 8; pin < lastPin; pin++) {
            // do not disturb non-digital pins (eg, Rx & Tx)
            if (IS_PIN_DIGITAL(pin) && (fm->getPinMode(pin) == OUTPUT || fm->getPinMode(pin) == INPUT)) {
                pinValue = ((byte) value & mask) ? 1 : 0;
                if (fm->getPinMode(pin) == OUTPUT) {
                    pinWriteMask |= mask;
                } else if (fm->getPinMode(pin) == INPUT && pinValue == 1 && fm->getPinState(pin) != 1) {
                    // only handle INPUT here for backwards compatibility
#if ARDUINO > 100
                    // pinMode(pin, INPUT_PULLUP);
#else
                    // only write to the INPUT pin to enable pullups if Arduino v1.0.0 or earlier
                    pinWriteMask |= mask;
#endif
                }
                board.setPinState(fm, FirmataStream, pin, pinValue);
            }
            mask = (byte) (mask << 1);
        }
        writePort(port, (byte) value, pinWriteMask);
#endif
    }
#endif
}

int mFirmata::loop(Stream *FirmataStream) {
    while (available(FirmataStream)) {
        processInput(FirmataStream);
        plc_var.info.task_busy |= 0x2;
        last_tick = rtos::ticks();
    }
#if defined(RTE_APP) || defined(PLC)
    report(FirmataStream);
#endif
    return 0;
}

mFirmata::mFirmata() {
    disableBlinkVersion();
    setFirmwareVersion(FIRMATA_FIRMWARE_MAJOR_VERSION, FIRMATA_FIRMWARE_MINOR_VERSION);
    attach(STRING_DATA, stringCallback);
    attach(START_SYSEX, sysexCallback);
    //    attach(ANALOG_MESSAGE, analogWriteCallback);
    //    attach(DIGITAL_MESSAGE, digitalWriteCallback);
    //    attach(REPORT_ANALOG, reportAnalogCallback);
    //    attach(REPORT_DIGITAL, reportDigitalCallback);
    //    attach(SET_DIGITAL_PIN_VALUE, setPinValueCallback);
    //    attach(SET_PIN_MODE, setPinModeCallback);
    //    attach(SYSTEM_RESET, systemResetCallback);
    i_am_here_cb = nullptr;
#ifdef FIRMATA_SERIAL_FEATURE
    serialFeature = new SerialFirmata();
#endif
}

#if defined(RTE_APP) || defined(PLC)

void mFirmata::report(Stream *FirmataStream) {
    u32 currentMillis = rtos::ticks();

    if (currentMillis - previousMillis > plc_var.config.reportInterval) {
        previousMillis += plc_var.config.reportInterval;
        /* ANALOGREAD - do all analogReads() at the configured sampling interval */
        board.readAnalogValue(this, FirmataStream, analogInputsToReport, sizeof(analogInputsToReport));
        for (byte pin = 0; pin < IO_XI_NRS + IO_YO_NRS; pin++) {
            if (reportPINs[pin]) {
                outputPort(FirmataStream, pin, getPinState(pin), true);
            }
        }
    }
#ifdef FIRMATA_SERIAL_FEATURE
    serialFeature->update(this, FirmataStream);
#endif
    // if (queryIndex > -1) {
    //     for (byte i = 0; i < queryIndex + 1; i++) {
    //         readAndReportData(Firmata, query[i].addr, query[i].reg, query[i].bytes, query[i].stopTX);
    //     }
    // }
}

#endif

void mFirmata::outputPort(Stream *FirmataStream, byte portNumber, byte portValue, byte forceSend) {
    // pins not configured as INPUT are cleared to zeros
    //    portValue = portValue & portConfigInputs[portNumber];
    // only send if the value is different than previously sent
    if (portNumber < (IO_XI_NRS + IO_YO_NRS) &&
        (forceSend || previousPINs[portNumber] != portValue)) {
        sendDigitalPort(FirmataStream, portNumber, portValue);
        flush(FirmataStream);
        previousPINs[portNumber] = portValue;
    }
}

#ifdef windows_x86
#include <pthread.h>
#include <minwindef.h>
#include <profileapi.h>
#include <sysinfoapi.h>
u32 ticks()
{
    static LARGE_INTEGER s_frequency;
    static BOOL s_use_qpc = QueryPerformanceFrequency(&s_frequency);
    if (s_use_qpc)
    {
        LARGE_INTEGER now;
        QueryPerformanceCounter(&now);
        return (1000LL * now.QuadPart) / s_frequency.QuadPart;
    }
    //    else {
    //        return GetTickCount();
    //    }
}
void Delay(u32 ms)
{
    struct timespec interval
    {
    };
    interval.tv_nsec = ms * 1000000;
    pthread_delay_np(&interval);
}
#endif

int mFirmata::setValue(Stream *FirmataStream, int index, void *valBuf, u8 size) {
    byte *buf;
    buf = (byte *) malloc(size + 4);
    *(int *) buf = index;
    memcpy(&buf[4], valBuf, size);
    clr_flag(FM_WRITE_VALUE_REP);
    sendSysex(FirmataStream, FM_WRITE_VALUE, size + 4, (byte *) buf);
    free(buf);
    u32 tick = rtos::ticks() + 1000;
    while (get_flag(FM_WRITE_VALUE_REP) == 0) {
        rtos::Delay(1);
        if (rtos::ticks() > tick)
            return TIMEOUT;
    }
    return 0;
}

int mFirmata::get_flag(u16 cmd) {
    return respose[cmd / 8] & (1 << (cmd % 8));
}

int mFirmata::clr_flag(u16 cmd) {
    respose[cmd / 8] &= ~(1 << (cmd % 8));
    return 0;
}

int mFirmata::set_flag(u16 cmd) {
    if (cmd < FM_LAST) {
        respose[cmd / 8] |= (1 << (cmd % 8));
        return 0;
    }
    return -1;
}

int mFirmata::getValue(Stream *pStream, int index, u8 *value_buf, u16 len) {
    u8 buf[6];
    *(int *) buf = index;
    *(u16 *) &buf[4] = len;
    clr_flag(FM_READ_VALUE_REP);
    valueLen = 0;
    sendSysex(pStream, FM_READ_VALUE, 6, (byte *) buf);
    u32 tick = rtos::ticks() + 1000;
    while (get_flag(FM_READ_VALUE_REP) == 0) {
        rtos::Delay(1);
        if (rtos::ticks() > tick)
            return TIMEOUT;
    }
    if (valueLen == len) {
        memcpy(value_buf, valueBuf, valueLen);
        return valueLen;
    }
    return -1;
}

int mFirmata::getBit(Stream *pStream, int index, u8 *value_buf, u16 len) {
    u8 buf[6];
    *(int *) buf = index;
    *(u16 *) &buf[4] = len;
    clr_flag(FM_READ_BIT_REP);
    valueLen = 0;
    sendSysex(pStream, FM_READ_BIT, 6, (byte *) buf);
    u32 tick = rtos::ticks() + 1000;
    while (get_flag(FM_READ_BIT_REP) == 0) {
        rtos::Delay(1);
        if (rtos::ticks() > tick)
            return TIMEOUT;
    }
    if (valueLen == len) {
        for (int i = 0; i < len; i++) {
            value_buf[i] = (valueBuf[i / 8] & (1 << (i % 8))) ? 1 : 0;
        }
        return valueLen;
    }
    return -1;
}

int mFirmata::run(u32 tick) {
    if (tick > (last_tick + 5000)) {
        plc_var.info.task_busy &= (~0x2);
    }
    return 0;
}
